<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.145">

    <Argument name="ip" type="_379" location="f5:1935" file="f5" line="1935"/>
  </Function>
  <Function id="_349" name="ncvarputs" returns="_366" context="_1" location="f5:1938" file="f5" line="1938" extern="1" mangled="_Z9ncvarputs">
    <Argument name="ncid" type="_366" location="f5:1938" file="f5" line="1938"/>
    <Argument name="varid" type="_366" location="f5:1938" file="f5" line="1938"/>
    <Argument name="startp" type="_397" location="f5:1938" file="f5" line="1938"/>
    <Argument name="countp" type="_397" location="f5:1938" file="f5" line="1938"/>
    <Argument name="stridep" type="_397" location="f5:1939" file="f5" line="1939"/>
    <Argument name="op" type="_380" location="f5:1939" file="f5" line="1939"/>
  </Function>
  <Function id="_350" name="ncvargets" returns="_366" context="_1" location="f5:1942" file="f5" line="1942" extern="1" mangled="_Z9ncvargets">
    <Argument name="ncid" type="_366" location="f5:1942" file="f5" line="1942"/>
    <Argument name="varid" type="_366" location="f5:1942" file="f5" line="1942"/>
    <Argument name="startp" type="_397" location="f5:1942" file="f5" line="1942"/>
    <Argument name="countp" type="_397" location="f5:1942" file="f5" line="1942"/>
    <Argument name="stridep" type="_397" location="f5:1943" file="f5" line="1943"/>
    <Argument name="ip" type="_379" location="f5:1943" file="f5" line="1943"/>
  </Function>
  <Function id="_351" name="ncvarputg" returns="_366" context="_1" location="f5:1946" file="f5" line="1946" extern="1" mangled="_Z9ncvarputg">
    <Argument name="ncid" type="_366" location="f5:1946" file="f5" line="1946"/>
    <Argument name="varid" type="_366" location="f5:1946" file="f5" line="1946"/>
    <Argument name="startp" type="_397" location="f5:1946" file="f5" line="1946"/>
    <Argument name="countp" type="_397" location="f5:1946" file="f5" line="1946"/>
    <Argument name="stridep" type="_397" location="f5:1947" file="f5" line="1947"/>
    <Argument name="imapp" type="_397" location="f5:1947" file="f5" line="1947"/>
    <Argument name="op" type="_380" location="f5:1947" file="f5" line="1947"/>
  </Function>
  <Function id="_352" name="ncvargetg" returns="_366" context="_1" location="f5:1950" file="f5" line="1950" extern="1" mangled="_Z9ncvargetg">
    <Argument name="ncid" type="_366" location="f5:1950" file="f5" line="1950"/>
    <Argument name="varid" type="_366" location="f5:1950" file="f5" line="1950"/>
    <Argument name="startp" type="_397" location="f5:1950" file="f5" line="1950"/>
    <Argument name="countp" type="_397" location="f5:1950" file="f5" line="1950"/>
    <Argument name="stridep" type="_397" location="f5:1951" file="f5" line="1951"/>
    <Argument name="imapp" type="_397" location="f5:1951" file="f5" line="1951"/>
    <Argument name="ip" type="_379" location="f5:1951" file="f5" line="1951"/>
  </Function>
  <Function id="_353" name="ncvarrename" returns="_366" context="_1" location="f5:1954" file="f5" line="1954" extern="1" mangled="_Z11ncvarrename">
    <Argument name="ncid" type="_366" location="f5:1954" file="f5" line="1954"/>
    <Argument name="varid" type="_366" location="f5:1954" file="f5" line="1954"/>
    <Argument name="name" type="_369" location="f5:1954" file="f5" line="1954"/>
  </Function>
  <Function id="_354" name="ncrecinq" returns="_366" context="_1" location="f5:1957" file="f5" line="1957" extern="1" mangled="_Z8ncrecinq">
    <Argument name="ncid" type="_366" location="f5:1957" file="f5" line="1957"/>
    <Argument name="nrecvarsp" type="_368" location="f5:1957" file="f5" line="1957"/>
    <Argument name="recvaridsp" type="_368" location="f5:1957" file="f5" line="1957"/>
    <Argument name="recsizesp" type="_398" location="f5:1957" file="f5" line="1957"/>
  </Function>
  <Function id="_355" name="ncrecget" returns="_366" context="_1" location="f5:1960" file="f5" line="1960" extern="1" mangled="_Z8ncrecget">
    <Argument name="ncid" type="_366" location="f5:1960" file="f5" line="1960"/>
    <Argument name="recnum" type="_364" location="f5:1960" file="f5" line="1960"/>
    <Argument name="datap" type="_409" location="f5:1960" file="f5" line="1960"/>
  </Function>
  <Function id="_356" name="ncrecput" returns="_366" context="_1" location="f5:1963" file="f5" line="1963" extern="1" mangled="_Z8ncrecput">
    <Argument name="ncid" type="_366" location="f5:1963" file="f5" line="1963"/>
    <Argument name="recnum" type="_364" location="f5:1963" file="f5" line="1963"/>
    <Argument name="datap" type="_410" location="f5:1963" file="f5" line="1963"/>
  </Function>
  <Function id="_357" name="nc_initialize" returns="_366" context="_1" location="f5:1968" file="f5" line="1968" extern="1" mangled="_Z13nc_initialize"/>
  <Function id="_358" name="nc_finalize" returns="_366" context="_1" location="f5:1974" file="f5" line="1974" extern="1" mangled="_Z11nc_finalize"/>
  <FundamentalType id="_359" name="__int128" size="128" align="128"/>
  <FundamentalType id="_360" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_361" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_411 _412 _413 _414" size="256" align="64"/>
  <PointerType id="_362" type="_415" size="64" align="64"/>
  <ArrayType id="_363" min="0" max="0" type="_416"/>
  <FundamentalType id="_364" name="long int" size="64" align="64"/>
  <FundamentalType id="_365" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_366" name="int" size="32" align="32"/>
  <FundamentalType id="_367" name="long double" size="128" align="128"/>
  <PointerType id="_368" type="_366" size="64" align="64"/>
  <PointerType id="_369" type="_415c" size="64" align="64"/>
  <PointerType id="_370" type="_17" size="64" align="64"/>
  <PointerType id="_371" type="_370" size="64" align="64"/>
  <PointerType id="_372" type="_8" size="64" align="64"/>
  <PointerType id="_373" type="_13" size="64" align="64"/>
  <PointerType id="_374" type="_366c" size="64" align="64"/>
  <CvQualifiedType id="_366c" type="_366" const="1"/>
  <Field id="_375" name="len" type="_8" context="_55" access="public" location="f5:686" file="f5" line="686" offset="0"/>
  <Field id="_376" name="p" type="_379" context="_55" access="public" location="f5:687" file="f5" line="687" offset="64"/>
  <PointerType id="_377" type="_56" size="64" align="64"/>
  <ArrayType id="_378" min="0" max="" type="_56"/>
  <PointerType id="_379" type="_408" size="64" align="64"/>
  <PointerType id="_380" type="_408c" size="64" align="64"/>
  <PointerType id="_381" type="_362" size="64" align="64"/>
  <FundamentalType id="_382" name="long long int" size="64" align="64"/>
  <PointerType id="_383" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <PointerType id="_384" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <FundamentalType id="_385" name="unsigned int" size="32" align="32"/>
  <PointerType id="_386" type="_385c" size="64" align="64"/>
  <CvQualifiedType id="_385c" type="_385" const="1"/>
  <PointerType id="_387" type="_385" size="64" align="64"/>
  <FundamentalType id="_388" name="float" size="32" align="32"/>
  <PointerType id="_389" type="_388" size="64" align="64"/>
  <PointerType id="_390" type="_369" size="64" align="64"/>
  <PointerType id="_391" type="_417c" size="64" align="64"/>
  <PointerType id="_392" type="_417" size="64" align="64"/>
  <PointerType id="_393" type="_418c" size="64" align="64"/>
  <PointerType id="_394" type="_418" size="64" align="64"/>
  <PointerType id="_395" type="_419c" size="64" align="64"/>
  <PointerType id="_396" type="_419" size="64" align="64"/>
  <PointerType id="_397" type="_364c" size="64" align="64"/>
  <CvQualifiedType id="_364c" type="_364" const="1"/>
  <PointerType id="_398" type="_364" size="64" align="64"/>
  <PointerType id="_399" type="_388c" size="64" align="64"/>
  <CvQualifiedType id="_388c" type="_388" const="1"/>
  <PointerType id="_400" type="_420c" size="64" align="64"/>
  <PointerType id="_401" type="_420" size="64" align="64"/>
  <PointerType id="_402" type="_421c" size="64" align="64"/>
  <PointerType id="_403" type="_421" size="64" align="64"/>
  <PointerType id="_404" type="_382c" size="64" align="64"/>
  <CvQualifiedType id="_382c" type="_382" const="1"/>
  <PointerType id="_405" type="_382" size="64" align="64"/>
  <PointerType id="_406" type="_422c" size="64" align="64"/>
  <PointerType id="_407" type="_422" size="64" align="64"/>
  <FundamentalType id="_408" name="void" size="0" align="8"/>
  <CvQualifiedType id="_408c" type="_408" const="1"/>
  <PointerType id="_409" type="_379" size="64" align="64"/>
  <PointerType id="_410" type="_379c" size="64" align="64"/>
  <CvQualifiedType id="_379c" type="_379" const="1"/>
  <Field id="_411" name="isa" type="_374" context="_361" access="public" offset="0"/>
  <Field id="_412" name="flags" type="_366" context="_361" access="public" offset="64"/>
  <Field id="_413" name="str" type="_369" context="_361" access="public" offset="128"/>
  <Field id="_414" name="length" type="_364" context="_361" access="public" offset="192"/>
  <CvQualifiedType id="_415c" type="_415" const="1"/>
  <Struct id="_416" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_423 _424 _425 _426" size="192" align="64"/>
  <CvQualifiedType id="_417c" type="_417" const="1"/>
  <CvQualifiedType id="_418c" type="_418" const="1"/>
  <CvQualifiedType id="_419c" type="_419" const="1"/>
  <CvQualifiedType id="_420c" type="_420" const="1"/>
  <CvQualifiedType id="_421c" type="_421" const="1"/>
  <CvQualifiedType id="_422c" type="_422" const="1"/>
  <Field id="_423" name="gp_offset" type="_385" context="_416" access="public" offset="0"/>
  <Field id="_424" name="fp_offset" type="_385" context="_416" access="public" offset="32"/>
  <Field id="_425" name="overflow_arg_area" type="_379" context="_416" access="public" offset="64"/>
  <Field id="_426" name="reg_save_area" type="_379" context="_416" access="public" offset="128"/>
  <FundamentalType id="_415" name="char" size="8" align="8"/>
  <FundamentalType id="_417" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_418" name="signed char" size="8" align="8"/>
  <FundamentalType id="_419" name="short int" size="16" align="16"/>
  <FundamentalType id="_420" name="double" size="64" align="64"/>
  <FundamentalType id="_421" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_422" name="long long unsigned int" size="64" align="64"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/stddef.h"/>
  <File id="f2" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/__stddef_max_align_t.h"/>
  <File id="f3" name="/Library/Developer/CommandLineTools/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_errno_t.h"/>
  <File id="f4" name="/Library/Developer/CommandLineTools/SDKs/MacOSX10.14.sdk/usr/include/sys/errno.h"/>
  <File id="f5" name="/usr/local/include/netcdf.h"/>
</GCC_XML>
